<?php
include_once("../../model/DAO.class.php");

//##############################################################################
//          déclaration et initialisation des variables
//##############################################################################
session_start();
extract($_SESSION);
//echo "<pre>";
//var_dump($_SESSION);
//echo "</pre>";

//##############################################################################
//          récupération des données
//##############################################################################

//##############################################################################
//          traitement, accès au modèle
//##############################################################################
$deplacementAll = $dao->getDeplacementAll();

//echo "<pre>";
//var_dump($deplacementAll);
//echo "</pre>";
//$date = new DateTime($deplacement->debut_depl);
//$debut_depl = $date->format('d-m-Y');
//##############################################################################
//         sélection de la vue
//##############################################################################
include("gestion.view.php");
?>
